[
    { "name": "Gomu Gomu no Mi", "color": "Púrpura", "power": "Hacer el cuerpo elástico", "eater": "Monkey D. Luffy", "type": "Paramecia", "image": "https://drive.google.com/file/d/14j95LZLr4oGUE7nUsvBZtS_Zu4db7JO2/view?usp=drive_link", "description_card": "Fruta que permite al portador estirar cualquier parte de su cuerpo", "description_fruit": "Es una Fruta del Tipo Paramecia, lo que significa que otorga a su consumidor habilidades físicas especiales sin cambiar su forma completamente. En el caso de la Gomu Gomu no Mi, permite al usuario estirar y deformar su cuerpo como si fuera goma. Esto le da a su portador una serie de habilidades únicas y asombrosas. Monkey D. Luffy es el protagonista principal de One Piece y el portador de la Gomu Gomu no Mi. Es un joven pirata que busca convertirse en el Rey de los Piratas y encontrar el legendario tesoro conocido como el One Piece. Luffy es conocido por su personalidad alegre y despreocupada, su amor por la aventura y su fuerte sentido de la justicia. A pesar de su naturaleza ingenua, es un luchador formidable y está dispuesto a arriesgar todo por sus amigos y sus ideales." },
    { "name": "Mera Mera no Mi", "color": "Azul", "power": "Dominar el fuego", "eater": "Sabo", "type": "Logia", "image": "https://drive.google.com/file/d/1s-Ql2NLct9vaeqtN5bXb1yk3AAPLs8iQ/view?usp=drive_link", "description_card": "Permite al usuario dominar el fuego", "description_fruit": "Esta Fruta del Diablo, de tipo Logia, es una de las muchas frutas misteriosas que otorgan poderes sobrenaturales a su consumidor. La Fruta del Diablo del Fuego concede al usuario la capacidad de convertirse en un hombre de fuego y controlar las llamas a su voluntad. Actualmente el portador de la fruta es uno de los hermanos de Luffy, llamado Sabo. Sabo es un hermano de luffy el cual pertenece al ejercito revolucioanrio, ejercito de piratas que va en contra del gobierno instaurado el cual rige las leyes del poder sobre el mundo de One piece." },
    { "name": "Hana Hana no Mi", "color": "Rosa", "power": "Crear y controlar flores", "eater": "Niko Robin", "type": "Paramesia", "image": "https://drive.google.com/file/d/12MsgKEhVrJdTJkGNPcAHDQjg1y6nxv6I/view?usp=drive_link", "description_card": "Fruta que permite al usuario crecer flores que pueden tomar la forma de una parte del cuerpo", "description_fruit": "La Hana Hana no Mi es una Fruta del Diablo del tipo Paramecia que otorga a su consumidor el poder de crear flores en cualquier parte de su cuerpo y controlarlas a su voluntad. Esta fruta es única en su género y confiere a su usuario habilidades sorprendentes, como crear cualquier parte del cuerpo en diferentes areas. Nico Robin utiliza esta fruta de manera estratégica y letal en combate, creando manos y extremidades adicionales que le permiten someter a sus enemigos de diversas maneras. Además, utiliza su habilidad para investigar la historia antigua y buscar el legendario tesoro One Piece"},
    { "name": "Gura Gura no Mi", "color": "Blanco", "power": "Control de las vibraciones", "eater": "Edward Newgate (Barbablanca)", "type": "Paramecia", "image": "https://drive.google.com/file/d/1o-pM9Yv_AdqDThgEbMUkQR9PkIHXl69u/view?usp=drive_link", "description_card": "Fruta que permite al usuario crear vibraciones provocando terremotos o maremotos", "description_fruit": "Es conocida como la Fruta del Diablo Temblorosa. Esta fruta es considerada una de las frutas del diablo más poderosas y temidas en todo el mundo debido a su capacidad para controlar las ondas de choque y causar terremotos masivos. Su portador es barba blanca, un anciano considerado uno de los piratas mas poderosos, contando con mucha experiencia en el mar que compartio con el antiguo y enemigo rey de los piratas, Gold D. Roger." },
    { "name": "Yami Yami no Mi", "color": "Negro", "power": "Absorber y controlar la oscuridad", "eater": "Marshall D. Teach (Barbanegra)", "type": "Logia", "image": "https://drive.google.com/file/d/1vNNZGyznBho2-2qWxE7SVKvbFxHRJmMQ/view?usp=drive_link", "description_card": "Fruta que permite al usuario manejar la oscuridad, algo muy único y extraño", "description_fruit": "La Yami Yami no Mi es una de las Frutas del Diablo más temibles y misteriosas en el mundo de One Piece. Es una Fruta del Diablo del tipo Logia, lo que significa que otorga a su consumidor la capacidad de crear, controlar y convertirse en una sustancia elemental, en este caso, la oscuridad. Barbanegra es un personaje ambicioso y despiadado que tiene como objetivo convertirse en el pirata más poderoso y encontrar el One Piece. A lo largo de la serie, se convierte en uno de los Siete Guerreros del Mar y utiliza su inteligencia y astucia para alcanzar sus objetivos. La combinación de la Yami Yami no Mi con su habilidad para absorber otras Frutas del Diablo lo ha convertido en un adversario formidable." },
    { "name": "Ope Ope no Mi", "color": "Rojo", "power": "Crear una sala de operaciones", "eater": "Trafalgar D. Water Law", "type": "Paramecia", "image": "https://drive.google.com/file/d/1wTgWweuehX2B4oVqfkxLskPgda0IP2LH/view?usp=drive_link", "description_card": "Fruta que permite al usuario hacer operaciones quirúrjicas en una sala creada por el mismo", "description_fruit": "Esta fruta es conocida por otorgar a su usuario habilidades médicas y quirúrgicas extraordinarias, como cortar cualquier parte del cuerpo sin herir al oponente o paciente. Tambien posee la capacidad de crear una sala especial en la que pueden manipular objetos y personas dentro de un radio determinado. Law es un pirata y ex miembro de los Piratas de Heart. Es conocido por su actitud calmada y estratégica, así como por su habilidad para usar la Ope Ope no Mi de manera creativa tanto en la medicina como en la batalla. Law se convierte en un aliado clave de Luffy y los Piratas del Sombrero de Paja durante varios arcos de la historia."},
    { "name": "Mochi Mochi no Mi", "color": "Blanca", "power": "Controlar lo pegajoso", "eater": "Charlotte Katakuri", "type": "Paramecia", "image": "https://drive.google.com/file/d/1XBLh9qcHLj-C09PDQ4R2f_e_N32zmfMM/view?usp=drive_link", "description_card": "Permite al usuario modificar su cuerpo o el espacio en cosas pegajosas", "description_fruit": "El usuario que posee la habilidad de la Fruta Mochi Mochi es Charlotte Katakuri, uno de los Tres Comandantes Dulces de la tripulación de los Piratas de Big Mom. La Fruta Mochi Mochi es una Fruta del Diablo de tipo Paramecia que le otorga a Katakuri la capacidad de crear, controlar y transformarse en mochi, que es una especie de masa de arroz glutinoso y pegajoso muy popular en la cocina japonesa." },
    { "name": "Soru Soru no Mi", "color": "Rosa", "power": "Tomar y dar vida con almas", "eater": "Charlotte Linlin", "type": "Paramecia", "image": "https://drive.google.com/file/d/1bXkgtEqaTTS-TrM4sNpMbPL-HtV3NCnJ/view?usp=drive_link", "description_card": "Fruta que le permite al usuario controlar las almas de las personas y darle vida a objetos inanimados", "description_fruit": "La Fruta Soru Soru no Mi es una de las Frutas del Diablo más poderosas y únicas en el mundo de One Piece, y le ha otorgado a Big Mom un estatus temible en el Nuevo Mundo. Su capacidad para absorber almas y crear homies la convierte en una de las Yonko más peligrosas, y su deseo de crear un mundo de diversidad alimentaria en su territorio de Totto Land ha sido una parte importante de la trama en la saga Whole Cake Island."},
    { "name": "Moku Moku no Mi", "color": "Blanco", "power": "Controlar el humo", "eater": "Smoker", "type": "Logia", "image": "https://drive.google.com/file/d/1azXU6g4cwUUIDcHt9tdp4qcsuR9iXLK7/view?usp=drive_link", "description_card": "Le otorga al usuario la capacidad de volverse en humo o crear humo", "description_fruit": "Esta fruta fue consumida por Smoker, un vicealmirante de la Marina que aparece en varias etapas de la historia de One Piece. La Moku Moku no Mi le otorga a Smoker la capacidad de crear, controlar y transformarse en humo. La Moku Moku no Mi es una de las Frutas del Diablo más icónicas en One Piece debido a su capacidad de transformarse en humo, lo que la convierte en un poder formidable en el mundo de la serie. Smoker la utiliza hábilmente en su búsqueda de hacer cumplir la justicia en el mundo de One Piece y en su enfrentamiento con los piratas." }
]